app/controllers/events_controller.rb

  def create_event_a
    event = Event.new
    event.event_name = 'Event A'
    event.user_id = current_user.id
    event.save
---
INSERT INTO "events" ("event_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["event_name", "Event A"], ["user_id", 1], ["created_at", "2023-11-03 04:16:36.486193"], ["updated_at", "2023-11-03 04:16:36.486193"]]

  def create_event_b
    event = Event.new
    event.event_name = 'Event B'
    event.user_id = current_user.id
    event.save
---
INSERT INTO "events" ("event_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["event_name", "Event B"], ["user_id", 1], ["created_at", "2023-11-03 04:17:49.780113"], ["updated_at", "2023-11-03 04:17:49.780113"]]

  def send_email_for_b
    events = Event.where(event_name: 'Event B')
    template_id = ""
    events.each do |event|
---
SELECT "events".* FROM "events" WHERE "events"."event_name" = ?  [["event_name", "Event B"]]